zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT700/MIMXRT735S/MIMXRT735S_cm33_core0_COMMON.h
/*
** ###################################################################
**     Processors:          MIMXRT735SGAWBR_cm33_core0
**                          MIMXRT735SGFOB_cm33_core0
**                          MIMXRT735SGVKB_cm33_core0
**
**     Compilers:
**                          GNU C Compiler
**                          IAR ANSI C/C++ Compiler for ARM
**                          Keil ARM C/C++ Compiler
**                          MCUXpresso Compiler
**
**     Reference manual:    iMXRT700RM Rev.5, 10/2025
**     Version:             rev. 6.0, 2025-12-29
**     Build:               b260429
**
**     Abstract:
**         CMSIS Peripheral Access Layer for MIMXRT735S_cm33_core0
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2026 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2022-09-15)
**         Initial version.
**     - rev. 2.0 (2024-05-28)
**         Rev2 DraftA.
**     - rev. 3.0 (2024-10-29)
**         Change the device header file from single flat file to multiple files based on peripherals,
**         each peripheral with dedicated header file located in periphN folder.
**     - rev. 4.0 (2025-06-06)
**         B0 initial version
**     - rev. 5.0 (2025-11-13)
**         Add puf/sdadc irq and cache64 compatibility macros to common header.
**     - rev. 5.1 (2025-12-08)
**         Update RM version and add pdm irq for hifi1/hifi4.
**     - rev. 6.0 (2025-12-29)
**         Add new part number.
**
** ###################################################################
*/

/*!
 * @file MIMXRT735S_cm33_core0_COMMON.h
 * @version 6.0
 * @date 2025-12-29
 * @brief CMSIS Peripheral Access Layer for MIMXRT735S_cm33_core0
 *
 * CMSIS Peripheral Access Layer for MIMXRT735S_cm33_core0
 */

#if !defined(MIMXRT735S_CM33_CORE0_COMMON_H_)
#define MIMXRT735S_CM33_CORE0_COMMON_H_          /**< Symbol preventing repeated inclusion */

/** Memory map major version (memory maps with equal major version number are
 * compatible) */
#define MCU_MEM_MAP_VERSION 0x0600U
/** Memory map minor version */
#define MCU_MEM_MAP_VERSION_MINOR 0x0000U


/* ----------------------------------------------------------------------------
   -- Interrupt vector numbers
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Interrupt_vector_numbers Interrupt vector numbers
 * @{
 */

/** Interrupt Number Definitions */
#define NUMBER_OF_INT_VECTORS 174                /**< Number of interrupts in the Vector table */

typedef enum IRQn {
  /* Auxiliary constants */
  NotAvail_IRQn                = -128,             /**< Not available device specific interrupt */

  /* Core interrupts */
  NonMaskableInt_IRQn          = -14,              /**< Non Maskable Interrupt */
  HardFault_IRQn               = -13,              /**< Cortex-M33 SV Hard Fault Interrupt */
  MemoryManagement_IRQn        = -12,              /**< Cortex-M33 Memory Management Interrupt */
  BusFault_IRQn                = -11,              /**< Cortex-M33 Bus Fault Interrupt */
  UsageFault_IRQn              = -10,              /**< Cortex-M33 Usage Fault Interrupt */
  SecureFault_IRQn             = -9,               /**< Cortex-M33 Secure Fault Interrupt */
  SVCall_IRQn                  = -5,               /**< Cortex-M33 SV Call Interrupt */
  DebugMonitor_IRQn            = -4,               /**< Cortex-M33 Debug Monitor Interrupt */
  PendSV_IRQn                  = -2,               /**< Cortex-M33 Pend SV Interrupt */
  SysTick_IRQn                 = -1,               /**< Cortex-M33 System Tick Interrupt */

  /* Device specific interrupts */
  Reserved16_IRQn              = 0,                /**< Reserved interrupt 16 */
  UTICK0_IRQn                  = 1,                /**< Micro-tick Timer */
  MRT0_IRQn                    = 2,                /**< MRT: Ored Interrupt request */
  CTIMER0_IRQn                 = 3,                /**< CTIMER: Interrupt request */
  CTIMER1_IRQn                 = 4,                /**< CTIMER: Interrupt request */
  SCT0_IRQn                    = 5,                /**< SCT: Interrupt request */
  CTIMER3_IRQn                 = 6,                /**< CTIMER: Interrupt request */
  LP_FLEXCOMM0_IRQn            = 7,                /**< FLEXCOMM: Interrupt request */
  LP_FLEXCOMM1_IRQn            = 8,                /**< FLEXCOMM: Interrupt request */
  LP_FLEXCOMM2_IRQn            = 9,                /**< FLEXCOMM: Interrupt request */
  LP_FLEXCOMM3_IRQn            = 10,               /**< FLEXCOMM: Interrupt request */
  LP_FLEXCOMM4_IRQn            = 11,               /**< FLEXCOMM: Interrupt request */
  LP_FLEXCOMM5_IRQn            = 12,               /**< FLEXCOMM: Interrupt request */
  LPSPI14_IRQn                 = 13,               /**< LPSPI: Interrupt request */
  LPI2C15_IRQn                 = 14,               /**< LPI2C: Interrupt request */
  ADC_IRQn                     = 15,               /**< ADC0: Interrupt request */
  SDADC_IRQn                   = 16,               /**< SDADC0: Interrupt request */
  ACMP_IRQn                    = 17,               /**< ACMP: interrupt request */
  PDM_EVENT_IRQn               = 18,               /**< MIC: Interrupt request for read data or Error */
  PDM_HWVAD_EVENT_IRQn         = 19,               /**< MIC: Hardware Voice Activity Detector interrupt or error interrupt */
  HYPERVISOR_IRQn              = 20,               /**< SECURE: Compute domain P-Bus Hypervisor interrupt */
  SECURE_VIOLATION_IRQn        = 21,               /**< SECURE: Compute domain P-Bus Secure violation interrupt */
  SENSE_HYPERVISOR_IRQn        = 22,               /**< Sense domain Hypervisor interrupt */
  SENSE_SECURE_VIOLATION_IRQn  = 23,               /**< Sense domain Secure violation interrupt */
  MEDIA_HYPERVISOR_IRQn        = 24,               /**< Media domain Hypervisor interrupt */
  MEDIA_SECURE_VIOLATION_IRQn  = 25,               /**< Media domain Secure violation interrupt */
  RTC0_ALARM_IRQn              = 26,               /**< RTC: Alarm interrupt */
  RTC0_IRQn                    = 27,               /**< RTC: wakeup interrupt to Compute domain */
  Reserved44_IRQn              = 28,               /**< Reserved interrupt */
  MU0_A_IRQn                   = 29,               /**< MU0: MUA, CPU0 to HiFi1 */
  MU1_A_IRQn                   = 30,               /**< MU1: MUA, CPU0 to CPU1 */
  Reserved47_IRQn              = 31,               /**< Reserved interrupt */
  CTIMER2_IRQn                 = 32,               /**< CTIMER: Interrupt request */
  CTIMER4_IRQn                 = 33,               /**< CTIMER: Interrupt request */
  OS_EVENT_IRQn                = 34,               /**< OSEVENT: Event timer CPU0 Wakeup/interrupt */
  LP_FLEXCOMM6_IRQn            = 35,               /**< FLEXCOMM: Interrupt request */
  LP_FLEXCOMM7_IRQn            = 36,               /**< FLEXCOMM: Interrupt request */
  USDHC0_IRQn                  = 37,               /**< USDHC: Interrupt request */
  USDHC1_IRQn                  = 38,               /**< USDHC: Interrupt request */
  I3C0_IRQn                    = 39,               /**< I3C: Interrupt Request */
  USB0_IRQn                    = 40,               /**< USB: HSUSB Interrup request */
  USB1_IRQn                    = 41,               /**< USB: eUSB Interrup request */
  WDT0_IRQn                    = 42,               /**< WDT: Interrupt request */
  WDT1_IRQn                    = 43,               /**< WDT: Interrupt request */
  USBPHY0_IRQn                 = 44,               /**< HSUSBPHY: UTM interrupt request */
  PUF_IRQn                     = 45,               /**< PUF: Interrupt Request */
  Reserved62_IRQn              = 46,               /**< Reserved interrupt 62 */
  LP_FLEXCOMM8_IRQn            = 47,               /**< FLEXCOMM: Interrupt request */
  LP_FLEXCOMM9_IRQn            = 48,               /**< FLEXCOMM: Interrupt request */
  LP_FLEXCOMM10_IRQn           = 49,               /**< FLEXCOMM: Interrupt request */
  LP_FLEXCOMM11_IRQn           = 50,               /**< FLEXCOMM: Interrupt request */
  LP_FLEXCOMM12_IRQn           = 51,               /**< FLEXCOMM: Interrupt request */
  LP_FLEXCOMM13_IRQn           = 52,               /**< FLEXCOMM: Interrupt request */
  LPSPI16_IRQn                 = 53,               /**< LPSPI: Interrupt request */
  I3C1_IRQn                    = 54,               /**< I3C: Interrupt Request */
  FLEXIO_IRQn                  = 55,               /**< FLEXIO: Interrupt request */
  Reserved72_IRQn              = 56,               /**< Reserved interrupt */
  Reserved73_IRQn              = 57,               /**< Reserved interrupt */
  MIPI_IRQn                    = 58,               /**< DSI: Interrupt request */
  EDMA0_CH0_IRQn               = 59,               /**< EDMA: Channel 0 interrupt */
  EDMA0_CH1_IRQn               = 60,               /**< EDMA: Channel 1 interrupt */
  EDMA0_CH2_IRQn               = 61,               /**< EDMA: Channel 2 interrupt */
  EDMA0_CH3_IRQn               = 62,               /**< EDMA: Channel 3 interrupt */
  EDMA0_CH4_IRQn               = 63,               /**< EDMA: Channel 4 interrupt */
  EDMA0_CH5_IRQn               = 64,               /**< EDMA: Channel 5 interrupt */
  EDMA0_CH6_IRQn               = 65,               /**< EDMA: Channel 6 interrupt */
  EDMA0_CH7_IRQn               = 66,               /**< EDMA: Channel 7 interrupt */
  EDMA0_CH8_IRQn               = 67,               /**< EDMA: Channel 8 interrupt */
  EDMA0_CH9_IRQn               = 68,               /**< EDMA: Channel 9 interrupt */
  EDMA0_CH10_IRQn              = 69,               /**< EDMA: Channel 10 interrupt */
  EDMA0_CH11_IRQn              = 70,               /**< EDMA: Channel 11 interrupt */
  EDMA0_CH12_IRQn              = 71,               /**< EDMA: Channel 12 interrupt */
  EDMA0_CH13_IRQn              = 72,               /**< EDMA: Channel 13 interrupt */
  EDMA0_CH14_IRQn              = 73,               /**< EDMA: Channel 14 interrupt */
  EDMA0_CH15_IRQn              = 74,               /**< EDMA: Channel 15 interrupt */
  EDMA1_CH0_IRQn               = 75,               /**< EDMA: Channel 0 interrupt */
  EDMA1_CH1_IRQn               = 76,               /**< EDMA: Channel 1 interrupt */
  EDMA1_CH2_IRQn               = 77,               /**< EDMA: Channel 2 interrupt */
  EDMA1_CH3_IRQn               = 78,               /**< EDMA: Channel 3 interrupt */
  EDMA1_CH4_IRQn               = 79,               /**< EDMA: Channel 4 interrupt */
  EDMA1_CH5_IRQn               = 80,               /**< EDMA: Channel 5 interrupt */
  EDMA1_CH6_IRQn               = 81,               /**< EDMA: Channel 6 interrupt */
  EDMA1_CH7_IRQn               = 82,               /**< EDMA: Channel 7 interrupt */
  EDMA1_CH8_IRQn               = 83,               /**< EDMA: Channel 8 interrupt */
  EDMA1_CH9_IRQn               = 84,               /**< EDMA: Channel 9 interrupt */
  EDMA1_CH10_IRQn              = 85,               /**< EDMA: Channel 10 interrupt */
  EDMA1_CH11_IRQn              = 86,               /**< EDMA: Channel 11 interrupt */
  EDMA1_CH12_IRQn              = 87,               /**< EDMA: Channel 12 interrupt */
  EDMA1_CH13_IRQn              = 88,               /**< EDMA: Channel 13 interrupt */
  EDMA1_CH14_IRQn              = 89,               /**< EDMA: Channel 14 interrupt */
  EDMA1_CH15_IRQn              = 90,               /**< EDMA: Channel 15 interrupt */
  GPIO00_IRQn                  = 91,               /**< GPIO: Interupt request, channel 0 */
  GPIO01_IRQn                  = 92,               /**< GPIO: Interupt request, channel 1 */
  GPIO10_IRQn                  = 93,               /**< GPIO: Interupt request, channel 0 */
  GPIO11_IRQn                  = 94,               /**< GPIO: Interupt request, channel 1 */
  GPIO20_IRQn                  = 95,               /**< GPIO: Interupt request, channel 0 */
  GPIO21_IRQn                  = 96,               /**< GPIO: Interupt request, channel 1 */
  GPIO30_IRQn                  = 97,               /**< GPIO: Interupt request, channel 0 */
  GPIO31_IRQn                  = 98,               /**< GPIO: Interupt request, channel 1 */
  GPIO40_IRQn                  = 99,               /**< GPIO: Interupt request, channel 0 */
  GPIO41_IRQn                  = 100,              /**< GPIO: Interupt request, channel 1 */
  GPIO50_IRQn                  = 101,              /**< GPIO: Interupt request, channel 0 */
  GPIO51_IRQn                  = 102,              /**< GPIO: Interupt request, channel 1 */
  GPIO60_IRQn                  = 103,              /**< GPIO: Interupt request, channel 0 */
  GPIO61_IRQn                  = 104,              /**< GPIO: Interupt request, channel 1 */
  GPIO70_IRQn                  = 105,              /**< GPIO: Interupt request, channel 0 */
  GPIO71_IRQn                  = 106,              /**< GPIO: Interupt request, channel 1 */
  PIN_INT0_IRQn                = 107,              /**< PINT: Interupt request 0 */
  PIN_INT1_IRQn                = 108,              /**< PINT: Interupt request 1 */
  PIN_INT2_IRQn                = 109,              /**< PINT: Interupt request 2 */
  PIN_INT3_IRQn                = 110,              /**< PINT: Interupt request 3 */
  PIN_INT4_IRQn                = 111,              /**< PINT: Interupt request 4 */
  PIN_INT5_IRQn                = 112,              /**< PINT: Interupt request 5 */
  PIN_INT6_IRQn                = 113,              /**< PINT: Interupt request 6 */
  PIN_INT7_IRQn                = 114,              /**< PINT: Interupt request 7 */
  SAI0_IRQn                    = 115,              /**< SAI: TX/RX interrupt */
  SAI1_IRQn                    = 116,              /**< SAI: TX/RX interrupt */
  SAI2_IRQn                    = 117,              /**< SAI: TX/RX interrupt */
  XSPI0_IRQn                   = 118,              /**< xSPI: Ored interrupt */
  XSPI1_IRQn                   = 119,              /**< xSPI: Ored interrupt */
  XSPI2_IRQn                   = 120,              /**< xSPI: Ored interrupt */
  MMU0_IRQn                    = 121,              /**< MMU: Interrupt request */
  MMU1_IRQn                    = 122,              /**< MMU: Interrupt request */
  MMU2_IRQn                    = 123,              /**< MMU: Interrupt request */
  Freqme_IRQn                  = 124,              /**< FREQME: Interrupt request */
  GDET0_IRQn                   = 125,              /**< GDET0: Interrupt request */
  Reserved142_IRQn             = 126,              /**< Reserved interrupt */
  Reserved143_IRQn             = 127,              /**< Reserved interrupt */
  GDET3_IRQn                   = 128,              /**< GDET3: Interrupt request */
  CDOG0_IRQn                   = 129,              /**< CDOG: Interrupt request */
  CDOG1_IRQn                   = 130,              /**< CDOG: Interrupt request */
  CDOG2_IRQn                   = 131,              /**< CDOG: Interrupt request */
  ITRC0_IRQn                   = 132,              /**< ITRC: Interrupt, cleared by software */
  ELS_IRQn                     = 133,              /**< ELS Interrupt request */
  PKC_IRQn                     = 134,              /**< PKC: Public Key Cryptography Interrutp */
  OSCCA_IRQn                   = 135,              /**< OSCCA: OSCCA Interrupt request */
  SLEEPCON0_IRQn               = 136,              /**< WAKEUP: CPU0 wakeup event */
  CPU0_IRQn                    = 137,              /**< CTI0: interrupt request */
  PMC_IRQn                     = 138,              /**< PMC: Compute domain Interrupt */
  Reserved155_IRQn             = 139,              /**< Reserved interrupt */
  Reserved156_IRQn             = 140,              /**< Reserved interrupt */
  NPU_IRQn                     = 141,              /**< NPU: Interrupt request */
  TRNG_IRQn                    = 142,              /**< TRNG: interrupt */
  TEMPDET0_IRQn                = 143,              /**< TEMPDET0: Interrupt request 0 */
  TEMPDET1_IRQn                = 144,              /**< TEMPDET1: Interrupt request 1 */
  EZHV_IRQn                    = 145,              /**< EZH-V: Interrupt request */
  GLIKEY0_IRQn                 = 146,              /**< GLIKEY: Interrupt */
  GLIKEY2_IRQn                 = 147,              /**< GLIKEY: Interrupt */
  GLIKEY3_IRQn                 = 148,              /**< GLIKEY: Interrupt */
  GLIKEY5_IRQn                 = 149,              /**< GLIKEY: Interrupt */
  PVTS0_CPU0_IRQn              = 150,              /**< PVTS0 CPU0 interrupt */
  Reserved167_IRQn             = 151,              /**< Reserved interrupt 167 */
  PVTS0_HIFI4_IRQn             = 152,              /**< PVTS0 HIFI4 interrupt */
  Reserved169_IRQn             = 153,              /**< Reserved interrupt 169 */
  FRO0_IRQn                    = 154,              /**< FRO: 300MHz FRO in VDD2 domain Async interrupt */
  FRO1_IRQn                    = 155,              /**< FRO: 192MHz FRO in VDD2 domain Async interrupt */
  FRO2_IRQn                    = 156,              /**< FRO: 300MHz FRO in VDD1 domain Async interrupt */
  OCOTP_IRQn                   = 157               /**< OCOTP warning and integrity error interrupt */
} IRQn_Type;

/*!
 * @}
 */ /* end of group Interrupt_vector_numbers */


/* ----------------------------------------------------------------------------
   -- Cortex M33 Core Configuration
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Cortex_Core_Configuration Cortex M33 Core Configuration
 * @{
 */

